Revit 2027 API
RebarBarType.DeformationType Property
 Defines bar deformation type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarDeformationType DeformationType { get; set; }
Public Property DeformationType As RebarDeformationType
	Get
	Set
public:
property RebarDeformationType DeformationType {
	RebarDeformationType get ();
	void set (RebarDeformationType value);
}
member DeformationType : RebarDeformationType with get, set
Property Value
RebarDeformationType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace